# Parameters
nc: 8  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [ 0.33, 0.25, 1024 ]  
  s: [ 0.33, 0.50, 1024 ]  
  m: [ 0.67, 0.75, 768 ] 
  l: [ 1.00, 1.00, 512 ]   
  x: [ 1.00, 1.25, 512 ]

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C3k2_DSConv, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C3k2_DSConv, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C3k2_DSConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C3k2_DSConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# head
head:
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]

  - [ 6, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C2f, [ 256 ] ]
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ 4, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C2f, [ 512 ] ]
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ 2, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C3k2_DSConv, [ 1024, False ] ]

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 20 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C3k2_DSConv, [ 1024, True ] ]

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 15 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C3k2_DSConv, [ 1024, True ] ]

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 10 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C3k2_DSConv, [ 1024, True ] ]

  - [ [ 24, 27, 30, 33 ], 1, Detect_dyhead, [ nc ] ]